src/main/resources/doReshopForReissue_OpenTicket.text

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.iata.org/IATA/EDIST/2017.2">   <soapenv:Header/>   <soapenv:Body>      <ns2:OrderReshopRQ Version="IATA2017.2" Target="OPEN" xsi:schemaLocation="xmldsig-core-schema.xsd" xmlns:ns2="http://www.iata.org/IATA/EDIST/2017.2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">         <ns2:Document>            <ns2:Name>PC NDC GATEWAY</ns2:Name>            <ns2:ReferenceVersion>1.0</ns2:ReferenceVersion>         </ns2:Document>         <ns2:Party>            <ns2:Sender>               <ns2:TravelAgencySender>                  <ns2:Contacts>                     <ns2:Contact>                        <ns2:EmailContact>                           <ns2:Address>IATI</ns2:Address>                        </ns2:EmailContact>                     </ns2:Contact>                  </ns2:Contacts>                  <ns2:AgencyID>NDCTEST</ns2:AgencyID>                  <ns2:AgentUser>                     <ns2:Name>IATI</ns2:Name>                     <ns2:AgentUserID>T621OC48</ns2:AgentUserID>                     <ns2:UserRole>ADMIN</ns2:UserRole>                  </ns2:AgentUser>               </ns2:TravelAgencySender>            </ns2:Sender>         </ns2:Party>         <ns2:ReshopParameters>            <ns2:CurrCodes>               <ns2:CurrCode>TRY</ns2:CurrCode>            </ns2:CurrCodes>         </ns2:ReshopParameters>         <ns2:Query>            <ns2:OrderID>replaceOrderID</ns2:OrderID>            <ns2:Reshop>               <ns2:OrderServicing>                  <ns2:Add>                                   <ns2:FlightQuery>                        <ns2:OriginDestinations>                           <ns2:OriginDestination> <ns2:Departure> <ns2:AirportCode>replaceNewPort1</ns2:AirportCode><ns2:Date>2222-01-01</ns2:Date></ns2:Departure><ns2:Arrival><ns2:AirportCode>replaceNewPort2</ns2:AirportCode></ns2:Arrival></ns2:OriginDestination></ns2:OriginDestinations></ns2:FlightQuery></ns2:Add><ns2:Delete><ns2:OrderItem OrderItemID="replaceSegmentId"/></ns2:Delete></ns2:OrderServicing></ns2:Reshop></ns2:Query><ns2:DataLists><ns2:PassengerList><ns2:Passenger PassengerID="SH1"><ns2:PTC>ADT</ns2:PTC><ns2:Birthdate>1992-01-01</ns2:Birthdate><ns2:ResidenceCountryCode>TR</ns2:ResidenceCountryCode><ns2:Individual><ns2:Gender/><ns2:GivenName>Cengizhan</ns2:GivenName><ns2:Surname>YILMAZ</ns2:Surname></ns2:Individual><ns2:IdentityDocument><ns2:IdentityDocumentNumber></ns2:IdentityDocumentNumber><ns2:IdentityDocumentType/></ns2:IdentityDocument></ns2:Passenger></ns2:PassengerList></ns2:DataLists></ns2:OrderReshopRQ></soapenv:Body></soapenv:Envelope>